## staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                NAME                                |
|----------|--------------------------------------------------------------------|
| update   | `aws_eks_node_group.notification-canada-ca-eks-node-group-k8s`     |
|          | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder` |
| recreate | `aws_secretsmanager_secret_version.eks_karpenter_ami_id`           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
13:26:37.013 STDOUT terraform:   ~ update in-place
13:26:37.013 STDOUT terraform: -/+ destroy and then create replacement
13:26:37.013 STDOUT terraform: Terraform will perform the following actions:
13:26:37.013 STDOUT terraform:   # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
13:26:37.013 STDOUT terraform:   ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
13:26:37.014 STDOUT terraform:         id                     = "notification-canada-ca-staging-eks-cluster:notification-canada-ca-staging-eks-primary-node-group-k8s"
13:26:37.014 STDOUT terraform:       ~ release_version        = "1.33.0-20250715" -> "1.33.3-20250807"
13:26:37.014 STDOUT terraform:         tags                   = {
13:26:37.014 STDOUT terraform:             "CostCenter"             = "notification-canada-ca-staging"
13:26:37.014 STDOUT terraform:             "Name"                   = "notification-canada-ca"
13:26:37.014 STDOUT terraform:             "karpenter.sh/discovery" = "notification-canada-ca-staging-eks-cluster"
13:26:37.014 STDOUT terraform:         }
13:26:37.014 STDOUT terraform:         # (16 unchanged attributes hidden)
13:26:37.014 STDOUT terraform:         # (3 unchanged blocks hidden)
13:26:37.014 STDOUT terraform:     }
13:26:37.014 STDOUT terraform:   # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
13:26:37.014 STDOUT terraform: -/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
13:26:37.014 STDOUT terraform:       ~ arn                  = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:EKS_KARPENTER_AMI_ID-RMKHzX" -> (known after apply)
13:26:37.014 STDOUT terraform:       + has_secret_string_wo = (known after apply)
13:26:37.014 STDOUT terraform:       ~ id                   = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:EKS_KARPENTER_AMI_ID-RMKHzX|terraform-20250721152946810000000002" -> (known after apply)
13:26:37.015 STDOUT terraform:       ~ secret_string        = (sensitive value) # forces replacement
13:26:37.015 STDOUT terraform:       ~ version_id           = "terraform-20250721152946810000000002" -> (known after apply)
13:26:37.015 STDOUT terraform:       ~ version_stages       = [
13:26:37.015 STDOUT terraform:           - "AWSCURRENT",
13:26:37.015 STDOUT terraform:         ] -> (known after apply)
13:26:37.015 STDOUT terraform:         # (3 unchanged attributes hidden)
13:26:37.015 STDOUT terraform:     }
13:26:37.015 STDOUT terraform:   # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be updated in-place
13:26:37.015 STDOUT terraform:   ~ resource "aws_lambda_function" "sentinel_forwarder" {
13:26:37.015 STDOUT terraform:         id                             = "sentinel-cloud-watch-forwarder"
13:26:37.015 STDOUT terraform:       ~ layers                         = [
13:26:37.015 STDOUT terraform:           ~ (sensitive value),
13:26:37.015 STDOUT terraform:         ]
13:26:37.015 STDOUT terraform:         tags                           = {
13:26:37.015 STDOUT terraform:             "CostCentre" = "notification-canada-ca-staging"
13:26:37.015 STDOUT terraform:         }
13:26:37.015 STDOUT terraform:         # (28 unchanged attributes hidden)
13:26:37.015 STDOUT terraform:         # (4 unchanged blocks hidden)
13:26:37.015 STDOUT terraform:     }
13:26:37.015 STDOUT terraform: Plan: 1 to add, 2 to change, 1 to destroy.
13:26:37.015 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
13:26:37.015 STDOUT terraform: Saved the plan to: plan.tfplan
13:26:37.015 STDOUT terraform: To perform exactly these actions, run the following command to apply:
13:26:37.015 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.oom-errors[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-host-logs[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
